# Найдите сумму цифр трехзначного числа.

#*Пример:*

#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0) |
n = int (input("введите трехзначное число"))
digital1 = n//100
digital2 = (n%100)//10
digital3 = n%10
sum = digital1 + digital2 + digital3
print (f"сумма чисел числа {n} равна {sum}")